theorema/old/eco1-demo-script.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Demo of Pillage Games Lemma 1 and 2 (eco1.nb)</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Demo of Pillage Games Lemma 1 and 2 (eco1.nb)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-25 08:58:44 CDT"/>
<meta name="author" content="Christoph Lange, Manfred Kerber, Colin Rowat"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Demo of Pillage Games Lemma 1 and 2 (eco1.nb)</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Prerequisites</a></li>
<li><a href="#sec-2">2 The basic axioms of pillage games</a></li>
<li><a href="#sec-3">3 Lemma 1 (representation of the power function)</a></li>
<li><a href="#sec-4">4 Anonymity and dominance</a></li>
<li><a href="#sec-5">5 Lemma 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Prerequisites</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li id="sec-1-1"><span class="todo TODO">TODO</span> Before going into detail about this, it would be good to have seen the following already:<br/>
<ul>
<li id="sec-1-1-1">the power function axioms<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2">Lemma 1 ("almost trivial", easy proof)<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-3">the dominance relation<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-4">Lemma 2 (trivial as well)<br/>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The basic axioms of pillage games</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li id="sec-2-1">Focus: What does the formalization look like?  How does Theorema work at all?<br/>
</li>
</ul>
<ul>
<li id="sec-2-2">Start with the preliminary definitions<br/>
<ul>
<li id="sec-2-2-1">Definition["agents"]<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-2">Definition["appropriateLength"]<br/>
    You have to make all of this explicit; on paper, it's often implicit.
</li>
</ul>
<ul>
<li id="sec-2-2-3">Show a very simple proof (of Lemma["1inI"]) to get a feeling<br/>
<ul>
<li id="sec-2-2-3-1">Not just a pointless lemma, but actually we'll need it later on.<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-3-2">This proof involves set theory, and computation on numbers (We'll get to that shortly)<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-3-3">Run proof, briefly show failed cases, then clean up and show<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-3-4">Theorema feature: paper-style presentation of a proof<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-3-5">To explain computation, show the computation of a concrete set of numbers<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-2-2-4">Show the slightly more complex proof of Lemma["1and2inI"], first with the default search depth of 30, then with 33<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-5">Show Definition["allocation"]; talk about types<br/>
<ul>
<li id="sec-2-2-5-1">Theorema is untyped<br/>
<ul>
<li id="sec-2-2-5-1-1">That's convenient when you quickly want to write down something<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-5-1-2">But it may lead to errors that are hard to find, when you compare apples to pears and the system doesn't warn you.<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-5-1-3">So if you want to avoid such mistakes, you'd better provide explicit type information, as you see here.<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-5-1-4">Strongly typed systems would fail with an error when you pass something with a wrong type – OTOH quite frustrating, because if you need types everywhere, you can easily get them wrong<br/>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-2-3">Definition["WC"]<br/>
</li>
</ul>
<ul>
<li id="sec-2-4">Definition["WR"]<br/>
<ul>
<li id="sec-2-4-1">Definition["WR contrapositive"]<br/>
<ul>
<li id="sec-2-4-1-1">Redundant, but needed to get the proof done, because it turned out that during the proof Theorema couldn't make use of the original formulation, but was in a situation where it rather expected the contrapositive.<br/>
</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-2-5">Definition["SR"]<br/>
</li>
</ul>
<ul>
<li id="sec-2-6">Definition["powerfunction"]<br/>
   combines the three axioms
</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Lemma 1 (representation of the power function)</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li id="sec-3-1">Now this is quite easy to state<br/>
</li>
</ul>
<ul>
<li id="sec-3-2">We need the auxiliary Axiom["trichotomy"] because Theorema doesn't have any special knowledge about real numbers.<br/>
</li>
</ul>
<ul>
<li id="sec-3-3">just scroll through the cleaned-up proof<br/>
</li>
</ul>
<ul>
<li id="sec-3-4">This works with the PredicateProver: simple first-order logic.  Theorema doesn't have one hard-wired logic, but comes with several logics.<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Anonymity and dominance</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li id="sec-4-1">Axiom["AN"]<br/>
</li>
</ul>
<ul>
<li id="sec-4-2">Definition["WinLose"]<br/>
</li>
</ul>
<ul>
<li id="sec-4-3">Definition["dominates"]<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Lemma 2</h2>
<div class="outline-text-2" id="text-5">

<ul>
<li id="sec-5-1">Lemma["ANdominates"]<br/>
</li>
</ul>
<ul>
<li id="sec-5-2">Automated proof of the direct statement doesn't work<br/>
<ul>
<li id="sec-5-2-1">run it, wait some time.  Reasons:<br/>
<ul>
<li id="sec-5-2-1-1">We don't know how long it will take; it may try forever (undecidability of first-order logic!)<br/>
</li>
</ul>
<ul>
<li id="sec-5-2-1-2">We didn't provide enough background knowledge<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-5-2-2">abort proof; Theorema will show incomplete proof object (feature!)<br/>
</li>
</ul>
<ul>
<li id="sec-5-2-3">at some positions: What do you expect, why doesn't Theorema proceed this way?<br/>
</li>
</ul>
<ul>
<li id="sec-5-2-4">You realize that you need additional axioms: What would be additional information that would be required at a certain point?  (Also need a good understanding of the <i>paper</i> form of the proof)<br/>
</li>
</ul>
<ul>
<li id="sec-5-2-5">Suitable axioms can be found by theory exploration<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-5-3">Need additional explicit background knowledge:<br/>
<ul>
<li id="sec-5-3-1">Lemma["perm swap"]<br/>
<ul>
<li id="sec-5-3-1-1">Show its proof, first without, then with built-in “=”: interesting due to the case "2=1"<br/>
<ul>
<li id="sec-5-3-1-1-1">Theorema has no knowledge about numbers.  Formalizing the natural numbers (an infinite set!) would require second-order logic (Peano axioms: induction).<br/>
</li>
</ul>
<ul>
<li id="sec-5-3-1-1-2">So for now, “1” and “2” are just unknown symbols, not instances of the Peano axioms<br/>
</li>
</ul>
<ul>
<li id="sec-5-3-1-1-3">We can ask Theorema to use some built-in knowledge about the equality of natural numbers (second proof attempt).<br/>
</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-5-3-2">Lemma["AN swap"]<br/>
<ul>
<li id="sec-5-3-2-1">This is a concrete instance of the anonymity axiom for the non-trivial case of permuting 2 agents (machines don't have a good intuition of non-triviality)<br/>
</li>
</ul>
<ul>
<li id="sec-5-3-2-2">Not straightforward to prove: We provide it as an assertion<br/>
<ul>
<li id="sec-5-3-2-2-1">Simply providing unproven assertions doesn't work in other systems<br/>
</li>
</ul>
<ul>
<li id="sec-5-3-2-2-2">In Mizar you have to prove everything from the built-in axioms of set theory.<br/>
</li>
</ul>
<ul>
<li id="sec-5-3-2-2-3">In other systems you need to explicitly call anything unproven an axiom.<br/>
</li>
</ul>
<ul>
<li id="sec-5-3-2-2-4">Therefore, Theorema is closer to mathematical practice.  (Something that has been established in literature doesn't have to be proven again, e.g. the intermediate value theorem.)<br/>
</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-5-3-3">Lemma["ANdominates 1"] and its proof, and what it uses<br/>
</li>
</ul>
<ul>
<li id="sec-5-3-4">Lemma["ANdominates 2"] analogously<br/>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-07-25 08:58:44 CDT</p>
<p class="author">Author: Christoph Lange, Manfred Kerber, Colin Rowat</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
